{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_conv_0conv_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_conv_0conv_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_conv_0conv", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_conv_0conv_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_0conv_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_0conv_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_0conv_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_conv_0conv", 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_conv_0conv", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_1a_1x1_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_1a_1x1_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_1a_1x1", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_1a_1x1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_1a_1x1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_1a_1x1_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_1a_1x1_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_1a_1x1", 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 1], [16, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_1a_1x1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_1a_3x3_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_1a_3x3_reduce_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_1a_3x3_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[9, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_1a_3x3_reduce_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_1a_3x3_reduce_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_1a_3x3_reduce_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_1a_3x3_reduce_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_1a_3x3_reduce", 
      "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0], [24, 0, 1], [25, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_1a_3x3_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_1a_3x3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_1a_3x3_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_1a_3x3", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[27, 0, 0], [28, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_1a_3x3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_1a_3x3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_1a_3x3_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_1a_3x3_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_1a_3x3", 
      "inputs": [[30, 0, 0], [31, 0, 0], [32, 0, 0], [33, 0, 1], [34, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_1a_3x3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_1a_double_3x3_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_1a_double_3x3_reduce_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_1a_double_3x3_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[9, 0, 0], [37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_1a_double_3x3_reduce_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_1a_double_3x3_reduce_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_1a_double_3x3_reduce_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_1a_double_3x3_reduce_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_1a_double_3x3_reduce", 
      "inputs": [[39, 0, 0], [40, 0, 0], [41, 0, 0], [42, 0, 1], [43, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_1a_double_3x3_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_1a_double_3x3_0_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_1a_double_3x3_0_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_1a_double_3x3_0", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[45, 0, 0], [46, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_1a_double_3x3_0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_1a_double_3x3_0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_1a_double_3x3_0_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_1a_double_3x3_0_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_1a_double_3x3_0", 
      "inputs": [[48, 0, 0], [49, 0, 0], [50, 0, 0], [51, 0, 1], [52, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_1a_double_3x3_0", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[53, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_1a_double_3x3_1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_1a_double_3x3_1_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_1a_double_3x3_1", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[54, 0, 0], [55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_1a_double_3x3_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_1a_double_3x3_1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_1a_double_3x3_1_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_1a_double_3x3_1_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_1a_double_3x3_1", 
      "inputs": [[57, 0, 0], [58, 0, 0], [59, 0, 0], [60, 0, 1], [61, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_1a_double_3x3_1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "avg_pool_1a_pool", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "avg", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_1a_proj_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_1a_proj_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_1a_proj", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[64, 0, 0], [65, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_1a_proj_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_1a_proj_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_1a_proj_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_1a_proj_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_1a_proj", 
      "inputs": [[67, 0, 0], [68, 0, 0], [69, 0, 0], [70, 0, 1], [71, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_1a_proj", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ch_concat_1a_chconcat", 
      "attr": {"num_args": "4"}, 
      "inputs": [[18, 0, 0], [36, 0, 0], [63, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_conv_0in2b_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_conv_0in2b_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_conv_0in2b", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[74, 0, 0], [75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_conv_0in2b_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_0in2b_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_0in2b_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_0in2b_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_conv_0in2b", 
      "inputs": [[77, 0, 0], [78, 0, 0], [79, 0, 0], [80, 0, 1], [81, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_conv_0in2b", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_conv_1in2b_weight", 
      "attr": {
        "kernel": "(1, 3)", 
        "num_filter": "32", 
        "pad": "(0, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_conv_1in2b_bias", 
      "attr": {
        "kernel": "(1, 3)", 
        "num_filter": "32", 
        "pad": "(0, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_conv_1in2b", 
      "attr": {
        "kernel": "(1, 3)", 
        "num_filter": "32", 
        "pad": "(0, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[83, 0, 0], [84, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_conv_1in2b_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_1in2b_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_1in2b_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_1in2b_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_conv_1in2b", 
      "inputs": [[86, 0, 0], [87, 0, 0], [88, 0, 0], [89, 0, 1], [90, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_conv_1in2b", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_conv_2in2b_weight", 
      "attr": {
        "kernel": "(3, 1)", 
        "num_filter": "32", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_conv_2in2b_bias", 
      "attr": {
        "kernel": "(3, 1)", 
        "num_filter": "32", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_conv_2in2b", 
      "attr": {
        "kernel": "(3, 1)", 
        "num_filter": "32", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[92, 0, 0], [93, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_conv_2in2b_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_2in2b_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_2in2b_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_2in2b_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_conv_2in2b", 
      "inputs": [[95, 0, 0], [96, 0, 0], [97, 0, 0], [98, 0, 1], [99, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_conv_2in2b", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_conv_3in2b_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_conv_3in2b_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_conv_3in2b", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[101, 0, 0], [102, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_conv_3in2b_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_3in2b_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_3in2b_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_3in2b_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_conv_3in2b", 
      "inputs": [[104, 0, 0], [105, 0, 0], [106, 0, 0], [107, 0, 1], [108, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_conv_3in2b", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[109, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_conv_4in2b_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_conv_4in2b_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_conv_4in2b", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[74, 0, 0], [111, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_conv_4in2b_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_4in2b_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_4in2b_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_4in2b_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_conv_4in2b", 
      "inputs": [[113, 0, 0], [114, 0, 0], [115, 0, 0], [116, 0, 1], [117, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_conv_4in2b", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[118, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_conv_5in2b_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_conv_5in2b_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_conv_5in2b", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[119, 0, 0], [120, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_conv_5in2b_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_5in2b_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_5in2b_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_5in2b_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_conv_5in2b", 
      "inputs": [[122, 0, 0], [123, 0, 0], [124, 0, 0], [125, 0, 1], [126, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_conv_5in2b", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling_in2b", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat_in2b", 
      "attr": {"num_args": "3"}, 
      "inputs": [[110, 0, 0], [128, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_2a_1x1_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_2a_1x1_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_2a_1x1", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[130, 0, 0], [131, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_2a_1x1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2a_1x1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2a_1x1_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2a_1x1_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_2a_1x1", 
      "inputs": [[133, 0, 0], [134, 0, 0], [135, 0, 0], [136, 0, 1], [137, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_2a_1x1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[138, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_2a_3x3_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_2a_3x3_reduce_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_2a_3x3_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[130, 0, 0], [140, 0, 0], [141, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_2a_3x3_reduce_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2a_3x3_reduce_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2a_3x3_reduce_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2a_3x3_reduce_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_2a_3x3_reduce", 
      "inputs": [[142, 0, 0], [143, 0, 0], [144, 0, 0], [145, 0, 1], [146, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_2a_3x3_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_2a_3x3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_2a_3x3_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_2a_3x3", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[148, 0, 0], [149, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_2a_3x3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2a_3x3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2a_3x3_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2a_3x3_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_2a_3x3", 
      "inputs": [[151, 0, 0], [152, 0, 0], [153, 0, 0], [154, 0, 1], [155, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_2a_3x3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[156, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_2a_double_3x3_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_2a_double_3x3_reduce_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_2a_double_3x3_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[130, 0, 0], [158, 0, 0], [159, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_2a_double_3x3_reduce_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2a_double_3x3_reduce_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2a_double_3x3_reduce_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2a_double_3x3_reduce_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_2a_double_3x3_reduce", 
      "inputs": [[160, 0, 0], [161, 0, 0], [162, 0, 0], [163, 0, 1], [164, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_2a_double_3x3_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[165, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_2a_double_3x3_0_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_2a_double_3x3_0_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_2a_double_3x3_0", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[166, 0, 0], [167, 0, 0], [168, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_2a_double_3x3_0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2a_double_3x3_0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2a_double_3x3_0_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2a_double_3x3_0_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_2a_double_3x3_0", 
      "inputs": [[169, 0, 0], [170, 0, 0], [171, 0, 0], [172, 0, 1], [173, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_2a_double_3x3_0", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[174, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_2a_double_3x3_1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_2a_double_3x3_1_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_2a_double_3x3_1", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[175, 0, 0], [176, 0, 0], [177, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_2a_double_3x3_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2a_double_3x3_1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2a_double_3x3_1_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2a_double_3x3_1_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_2a_double_3x3_1", 
      "inputs": [[178, 0, 0], [179, 0, 0], [180, 0, 0], [181, 0, 1], [182, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_2a_double_3x3_1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[183, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "avg_pool_2a_pool", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "avg", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_2a_proj_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_2a_proj_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_2a_proj", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[185, 0, 0], [186, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_2a_proj_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2a_proj_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2a_proj_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_2a_proj_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_2a_proj", 
      "inputs": [[188, 0, 0], [189, 0, 0], [190, 0, 0], [191, 0, 1], [192, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_2a_proj", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[193, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ch_concat_2a_chconcat", 
      "attr": {"num_args": "4"}, 
      "inputs": [[139, 0, 0], [157, 0, 0], [184, 0, 0], [194, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_conv_02b_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_conv_02b_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_conv_02b", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[195, 0, 0], [196, 0, 0], [197, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_conv_02b_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_02b_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_02b_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_02b_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_conv_02b", 
      "inputs": [[198, 0, 0], [199, 0, 0], [200, 0, 0], [201, 0, 1], [202, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_conv_02b", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_conv_12b_weight", 
      "attr": {
        "kernel": "(1, 3)", 
        "num_filter": "48", 
        "pad": "(0, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_conv_12b_bias", 
      "attr": {
        "kernel": "(1, 3)", 
        "num_filter": "48", 
        "pad": "(0, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_conv_12b", 
      "attr": {
        "kernel": "(1, 3)", 
        "num_filter": "48", 
        "pad": "(0, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[204, 0, 0], [205, 0, 0], [206, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_conv_12b_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_12b_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_12b_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_12b_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_conv_12b", 
      "inputs": [[207, 0, 0], [208, 0, 0], [209, 0, 0], [210, 0, 1], [211, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_conv_12b", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[212, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_conv_22b_weight", 
      "attr": {
        "kernel": "(3, 1)", 
        "num_filter": "48", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_conv_22b_bias", 
      "attr": {
        "kernel": "(3, 1)", 
        "num_filter": "48", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_conv_22b", 
      "attr": {
        "kernel": "(3, 1)", 
        "num_filter": "48", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[213, 0, 0], [214, 0, 0], [215, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_conv_22b_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_22b_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_22b_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_22b_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_conv_22b", 
      "inputs": [[216, 0, 0], [217, 0, 0], [218, 0, 0], [219, 0, 1], [220, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_conv_22b", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[221, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_conv_32b_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_conv_32b_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_conv_32b", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[222, 0, 0], [223, 0, 0], [224, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_conv_32b_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_32b_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_32b_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_32b_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_conv_32b", 
      "inputs": [[225, 0, 0], [226, 0, 0], [227, 0, 0], [228, 0, 1], [229, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_conv_32b", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[230, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_conv_42b_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_conv_42b_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_conv_42b", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[195, 0, 0], [232, 0, 0], [233, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_conv_42b_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_42b_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_42b_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_42b_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_conv_42b", 
      "inputs": [[234, 0, 0], [235, 0, 0], [236, 0, 0], [237, 0, 1], [238, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_conv_42b", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[239, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_conv_52b_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_conv_52b_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_conv_52b", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[240, 0, 0], [241, 0, 0], [242, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_conv_52b_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_52b_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_52b_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv_52b_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_conv_52b", 
      "inputs": [[243, 0, 0], [244, 0, 0], [245, 0, 0], [246, 0, 1], [247, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_conv_52b", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[248, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling_2b", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat_2b", 
      "attr": {"num_args": "3"}, 
      "inputs": [[231, 0, 0], [249, 0, 0], [250, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3a_1x1_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_1x1_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_3a_1x1", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[251, 0, 0], [252, 0, 0], [253, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3a_1x1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_1x1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_1x1_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_1x1_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3a_1x1", 
      "inputs": [[254, 0, 0], [255, 0, 0], [256, 0, 0], [257, 0, 1], [258, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3a_1x1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[259, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3a_3x3_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_3x3_reduce_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_3a_3x3_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[251, 0, 0], [261, 0, 0], [262, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3a_3x3_reduce_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_3x3_reduce_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_3x3_reduce_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_3x3_reduce_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3a_3x3_reduce", 
      "inputs": [[263, 0, 0], [264, 0, 0], [265, 0, 0], [266, 0, 1], [267, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3a_3x3_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[268, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3a_3x3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_3x3_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_3a_3x3", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[269, 0, 0], [270, 0, 0], [271, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3a_3x3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_3x3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_3x3_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_3x3_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3a_3x3", 
      "inputs": [[272, 0, 0], [273, 0, 0], [274, 0, 0], [275, 0, 1], [276, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3a_3x3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[277, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3a_double_3x3_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_double_3x3_reduce_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_3a_double_3x3_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[251, 0, 0], [279, 0, 0], [280, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_reduce_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_reduce_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_reduce_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_reduce_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3a_double_3x3_reduce", 
      "inputs": [[281, 0, 0], [282, 0, 0], [283, 0, 0], [284, 0, 1], [285, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3a_double_3x3_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[286, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3a_double_3x3_0_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_3a_double_3x3_0_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_3a_double_3x3_0", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[287, 0, 0], [288, 0, 0], [289, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_0_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_3a_double_3x3_0_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_3a_double_3x3_0", 
      "inputs": [[290, 0, 0], [291, 0, 0], [292, 0, 0], [293, 0, 1], [294, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_3a_double_3x3_0", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[295, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_3a_double_3x3_1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
