{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "color_up_conv_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "color_up_conv_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "color_up_conv", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "12", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "color_up_slice", 
      "attr": {
        "axis": "1", 
        "num_outputs": "2", 
        "squeeze_axis": "False"
      }, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum0", 
      "inputs": [[4, 0, 0], [4, 1, 0]]
    }, 
    {
      "op": "null", 
      "name": "color_down_conv_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "color_down_conv_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "color_down_conv", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "6", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "color_down_slice", 
      "attr": {
        "axis": "1", 
        "num_outputs": "2", 
        "squeeze_axis": "False"
      }, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum1", 
      "inputs": [[9, 0, 0], [9, 1, 0]]
    }, 
    {
      "op": "null", 
      "name": "m1_conv_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "m1_conv_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "m1_conv", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(5,5)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(2,2)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "m1_slice", 
      "attr": {
        "axis": "1", 
        "num_outputs": "2", 
        "squeeze_axis": "False"
      }, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum2", 
      "inputs": [[14, 0, 0], [14, 1, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1_avg", 
      "attr": {
        "global_pool": "False", 
        "kernel": "(2,2)", 
        "pad": "(0,0)", 
        "pool_type": "avg", 
        "pooling_convention": "valid", 
        "stride": "(2,2)"
      }, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1_max", 
      "attr": {
        "global_pool": "False", 
        "kernel": "(2,2)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2,2)"
      }, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "m2_1_conv_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "m2_1_conv_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "m2_1_conv", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "m2_1_slice", 
      "attr": {
        "axis": "1", 
        "num_outputs": "2", 
        "squeeze_axis": "False"
      }, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum3", 
      "inputs": [[22, 0, 0], [22, 1, 0]]
    }, 
    {
      "op": "null", 
      "name": "m2_2_conv_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "m2_2_conv_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "m2_2_conv", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "m2_2_slice", 
      "attr": {
        "axis": "1", 
        "num_outputs": "2", 
        "squeeze_axis": "False"
      }, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum4", 
      "inputs": [[27, 0, 0], [27, 1, 0]]
    }, 
    {
      "op": "null", 
      "name": "m2_3_conv_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "m2_3_conv_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "m2_3_conv", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "m2_3_slice", 
      "attr": {
        "axis": "1", 
        "num_outputs": "2", 
        "squeeze_axis": "False"
      }, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum5", 
      "inputs": [[32, 0, 0], [32, 1, 0]]
    }, 
    {
      "op": "null", 
      "name": "m2_4_conv_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "m2_4_conv_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "m2_4_conv", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[33, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "m2_4_slice", 
      "attr": {
        "axis": "1", 
        "num_outputs": "2", 
        "squeeze_axis": "False"
      }, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum6", 
      "inputs": [[37, 0, 0], [37, 1, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool2_max", 
      "attr": {
        "global_pool": "False", 
        "kernel": "(2,2)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2,2)"
      }, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool2_avg", 
      "attr": {
        "global_pool": "False", 
        "kernel": "(2,2)", 
        "pad": "(0,0)", 
        "pool_type": "avg", 
        "pooling_convention": "valid", 
        "stride": "(2,2)"
      }, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[39, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "m3x_1_conv_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "m3x_1_conv_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "m3x_1_conv", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "196", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "m3x_1_slice", 
      "attr": {
        "axis": "1", 
        "num_outputs": "2", 
        "squeeze_axis": "False"
      }, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum7", 
      "inputs": [[45, 0, 0], [45, 1, 0]]
    }, 
    {
      "op": "null", 
      "name": "m3x_2_conv_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "m3x_2_conv_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "m3x_2_conv", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "196", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[46, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "m3x_2_slice", 
      "attr": {
        "axis": "1", 
        "num_outputs": "2", 
        "squeeze_axis": "False"
      }, 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum8", 
      "inputs": [[50, 0, 0], [50, 1, 0]]
    }, 
    {
      "op": "null", 
      "name": "m3_1_conv_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "m3_1_conv_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "m3_1_conv", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "m3_1_slice", 
      "attr": {
        "axis": "1", 
        "num_outputs": "2", 
        "squeeze_axis": "False"
      }, 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum9", 
      "inputs": [[55, 0, 0], [55, 1, 0]]
    }, 
    {
      "op": "null", 
      "name": "m3_2_conv_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "m3_2_conv_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "m3_2_conv", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[56, 0, 0], [57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "m3_2_slice", 
      "attr": {
        "axis": "1", 
        "num_outputs": "2", 
        "squeeze_axis": "False"
      }, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum10", 
      "inputs": [[60, 0, 0], [60, 1, 0]]
    }, 
    {
      "op": "null", 
      "name": "m3_3_conv_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "m3_3_conv_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "m3_3_conv", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "320", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[61, 0, 0], [62, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "m3_3_slice", 
      "attr": {
        "axis": "1", 
        "num_outputs": "2", 
        "squeeze_axis": "False"
      }, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum11", 
      "inputs": [[65, 0, 0], [65, 1, 0]]
    }, 
    {
      "op": "null", 
      "name": "m3_4_conv_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "m3_4_conv_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "m3_4_conv", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "320", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[66, 0, 0], [67, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "m3_4_slice", 
      "attr": {
        "axis": "1", 
        "num_outputs": "2", 
        "squeeze_axis": "False"
      }, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum12", 
      "inputs": [[70, 0, 0], [70, 1, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool3_avg", 
      "attr": {
        "global_pool": "False", 
        "kernel": "(2,2)", 
        "pad": "(0,0)", 
        "pool_type": "avg", 
        "pooling_convention": "valid", 
        "stride": "(2,2)"
      }, 
      "inputs": [[71, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool3_max", 
      "attr": {
        "global_pool": "False", 
        "kernel": "(2,2)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2,2)"
      }, 
      "inputs": [[71, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[72, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "m4_1_conv_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "m4_1_conv_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "m4_1_conv", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[74, 0, 0], [75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "m4_1_slice", 
      "attr": {
        "axis": "1", 
        "num_outputs": "2", 
        "squeeze_axis": "False"
      }, 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum13", 
      "inputs": [[78, 0, 0], [78, 1, 0]]
    }, 
    {
      "op": "null", 
      "name": "m4_2_conv_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "m4_2_conv_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "m4_2_conv", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[79, 0, 0], [80, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "m4_2_slice", 
      "attr": {
        "axis": "1", 
        "num_outputs": "2", 
        "squeeze_axis": "False"
      }, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum14", 
      "inputs": [[83, 0, 0], [83, 1, 0]]
    }, 
    {
      "op": "null", 
      "name": "m4_3_conv_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "m4_3_conv_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "m4_3_conv", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0], [86, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "m4_3_slice", 
      "attr": {
        "axis": "1", 
        "num_outputs": "2", 
        "squeeze_axis": "False"
      }, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum15", 
      "inputs": [[88, 0, 0], [88, 1, 0]]
    }, 
    {
      "op": "null", 
      "name": "m4_4_conv_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "m4_4_conv_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "m4_4_conv", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[89, 0, 0], [90, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "m4_4_slice", 
      "attr": {
        "axis": "1", 
        "num_outputs": "2", 
        "squeeze_axis": "False"
      }, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum16", 
      "inputs": [[93, 0, 0], [93, 1, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool4_max", 
      "attr": {
        "global_pool": "False", 
        "kernel": "(2,2)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2,2)"
      }, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool4_avg", 
      "attr": {
        "global_pool": "False", 
        "kernel": "(2,2)", 
        "pad": "(0,0)", 
        "pool_type": "avg", 
        "pooling_convention": "valid", 
        "stride": "(2,2)"
      }, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[95, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "m5_1_conv_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "m5_1_conv_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "m5_1_conv", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(5,5)", 
        "no_bias": "False", 
        "num_filter": "640", 
        "num_group": "1", 
        "pad": "(2,2)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[97, 0, 0], [98, 0, 0], [99, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "m5_1_slice", 
      "attr": {
        "axis": "1", 
        "num_outputs": "2", 
        "squeeze_axis": "False"
      }, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum17", 
      "inputs": [[101, 0, 0], [101, 1, 0]]
    }, 
    {
      "op": "null", 
      "name": "m5_2_conv_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "m5_2_conv_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "m5_2_conv", 
      "attr": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(5,5)", 
        "no_bias": "False", 
        "num_filter": "640", 
        "num_group": "1", 
        "pad": "(2,2)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[102, 0, 0], [103, 0, 0], [104, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "m5_2_slice", 
      "attr": {
        "axis": "1", 
        "num_outputs": "2", 
        "squeeze_axis": "False"
      }, 
      "inputs": [[105, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum18", 
      "inputs": [[106, 0, 0], [106, 1, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0", 
      "inputs": [[107, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout0", 
      "attr": {"p": "0.5"}, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc1_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc1", 
      "attr": {
        "no_bias": "False", 
        "num_hidden": "256"
      }, 
      "inputs": [[109, 0, 0], [110, 0, 0], [111, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    6, 
    7, 
    11, 
    12, 
    19, 
    20, 
    24, 
    25, 
    29, 
    30, 
    34, 
    35, 
    42, 
    43, 
    47, 
    48, 
    52, 
    53, 
    57, 
    58, 
    62, 
    63, 
    67, 
    68, 
    75, 
    76, 
    80, 
    81, 
    85, 
    86, 
    90, 
    91, 
    98, 
    99, 
    103, 
    104, 
    110, 
    111
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    6, 
    7, 
    8, 
    9, 
    10, 
    12, 
    13, 
    14, 
    15, 
    16, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    27, 
    28, 
    29, 
    30, 
    31, 
    33, 
    34, 
    35, 
    36, 
    37, 
    39, 
    40, 
    41, 
    42, 
    43, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    54, 
    55, 
    56, 
    57, 
    58, 
    60, 
    61, 
    62, 
    63, 
    64, 
    66, 
    67, 
    68, 
    69, 
    70, 
    72, 
    73, 
    74, 
    75, 
    76, 
    78, 
    79, 
    80, 
    81, 
    82, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    93, 
    94, 
    95, 
    96, 
    97, 
    99, 
    100, 
    101, 
    102, 
    103, 
    105, 
    106, 
    107, 
    108, 
    109, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    120, 
    121, 
    122, 
    123, 
    124, 
    126, 
    127, 
    128, 
    130, 
    131, 
    132, 
    133
  ], 
  "heads": [[112, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 905]}
}